{"posix":{"category":"Others","state":"enabled","description":"This module provide access to functions defined in IEEE 1003.1 (POSIX.1) that are not accessible with other means","name":"posix"},"mongodb":{"state":"disabled","category":"Others","name":"mongodb","description":""},"pdo_mysql":{"state":"enabled","category":"Others","name":"pdo_mysql","description":"Driver implementing access from PHP to MySQL"},"vips":{"description":"","name":"vips","category":"Others","state":"disabled"},"curl":{"description":"Interface to a powerful library for making HTTP, FTP and other requests and handling the output","name":"curl","category":"Others","state":"build-in"},"phalcon4":{"category":"Others","state":"disabled","description":"","name":"phalcon4"},"pdf":{"state":"disabled","category":"Others","name":"pdf","description":""},"amqp":{"state":"disabled","category":"Others","name":"amqp","description":""},"pdo_pgsql":{"state":"enabled","category":"Others","name":"pdo_pgsql","description":"Driver implementing access from PHP to PostgreSQL"},"gender":{"description":"Port of the gender.c program to find out the gender of firstnames. The actual database contains more than 40000 firstnames from 54 countries","name":"gender","category":"Others","state":"disabled"},"phalcon5":{"name":"phalcon5","description":"","state":"disabled","category":"Others"},"dom":{"state":"enabled","category":"Others","name":"dom","description":"The DOM extension allows you to operate on XML documents through the DOM API with PHP 5"},"pdo_sqlsrv":{"description":"","name":"pdo_sqlsrv","category":"Others","state":"disabled"},"odbc":{"state":"disabled","category":"Others","name":"odbc","description":"In addition to normal ODBC support, the Unified ODBC functions in PHP allow you to access several databases that have borrowed the semantics of the ODBC API to implement their own API. Instead of maintaining multiple database drivers that were all nearly identical, these drivers have been unified into a single set of ODBC functions"},"mysqlnd":{"name":"mysqlnd","description":"","state":"enabled","category":"Others"},"trader":{"state":"disabled","category":"Others","name":"trader","description":"The trader extension is a free open source stock library based on TA-Lib. It's dedicated to trading software developers requiring to perform technical analysis of financial market data. Alongside many indicators like ADX, MACD, RSI, Stochastic, TRIX the candlestick pattern recognition and several vector arithmetic and algebraic functions are present"},"sqlite3":{"name":"sqlite3","description":"Support for SQLite version 3 databases","state":"build-in","category":"Others"},"pdo_sqlite":{"category":"Others","state":"enabled","description":"Driver implementing access from PHP to SQLite","name":"pdo_sqlite"},"exif":{"state":"build-in","category":"Others","name":"exif","description":"Provides access for images EXIF metadata"},"redis":{"state":"disabled","category":"Others","name":"redis","description":""},"snuffleupagus":{"category":"Others","state":"disabled","description":"","name":"snuffleupagus"},"shmop":{"description":"Shmop is an easy to use set of functions that allows PHP to read, write, create and delete Unix shared memory segments","name":"shmop","category":"Others","state":"build-in"},"timezonedb":{"name":"timezonedb","description":"This extension is a drop-in replacement for the builtin timezone database that comes with PHP. You should only install this extension in case you need to get a later version of the timezone database than the one that ships with PHP","state":"disabled","category":"Others"},"snmp":{"state":"disabled","category":"Others","name":"snmp","description":"The SNMP extension provides a very simple and easily usable toolset for managing remote devices via the Simple Network Management Protocol"},"dba":{"category":"Others","state":"disabled","description":"These functions build the foundation for accessing Berkeley DB style databases. This is a general abstraction layer for several file-based databases. As such, functionality is limited to a common subset of features supported by modern databases such as Oracle Berkeley DB","name":"dba"},"opcache":{"name":"opcache","description":"","state":"enabled","category":"Others"},"enchant":{"state":"disabled","category":"Others","name":"enchant","description":"Enchant is the PHP binding for the Enchant library. Enchant steps in to provide uniformity and conformity on top of all spelling libraries, and implement certain features that may be lacking in any individual provider library"},"pspell":{"state":"disabled","category":"Others","name":"pspell","description":"These functions allow you to check the spelling of a word and offer suggestions"},"sockets":{"description":"The socket extension implements a low-level interface to the socket communication functions based on the popular BSD sockets, providing the possibility to act as a socket server as well as a client.","name":"sockets","category":"Others","state":"enabled"},"bz2":{"name":"bz2","description":"Functions for transparent reading and writing BZIP2 archives","state":"build-in","category":"Others"},"tideways_xhprof":{"name":"tideways_xhprof","description":"","state":"disabled","category":"Others"},"xml":{"description":"This PHP extension implements support for expat in PHP. This toolkit lets you parse, but not validate, XML documents","name":"xml","category":"Others","state":"build-in"},"oauth":{"category":"Others","state":"disabled","description":"This extension provides OAuth consumer and provider bindings. OAuth is an authorization protocol built on top of HTTP which allows applications to securely access data without having to store usernames and passwords","name":"oauth"},"eio":{"name":"eio","description":"This extension provides asynchronous POSIX IO by means of libeio C library","state":"disabled","category":"Others"},"geoip":{"category":"Others","state":"disabled","description":"This PHP extension allows you to find the location of an IP address - City, State, Country, Longitude, Latitude, and other information as all, such as ISP and connection type","name":"geoip"},"mysqli":{"category":"Others","state":"disabled","description":"This extension gives a user access to functionality provided by MySQL server 4.1 and above","name":"mysqli"},"fileinfo":{"category":"Others","state":"enabled","description":"This module functions try to determine a file content type and encoding by means of analyzing certain magic bytes sequences at certain positions of the file. This is not truly reliable method but for most situations that will do","name":"fileinfo"},"sysvmsg":{"state":"disabled","category":"Others","name":"sysvmsg","description":"System V messages support"},"sqlsrv":{"name":"sqlsrv","description":"","state":"disabled","category":"Others"},"gettext":{"description":"This module functions implement Native Language Support API for applications internationalization","name":"gettext","category":"Others","state":"build-in"},"libxml":{"description":"XML functionality","name":"libxml","category":"Others","state":"build-in"},"pdo":{"name":"pdo","description":"The PHP Data Objects (PDO) extension defines a lightweight, consistent interface for accessing databases in PHP. Each database driver that implements the PDO interface can expose database-specific features as regular extension functions. Note that you cannot perform any database functions using the PDO extension by itself; you must use a database-specific PDO driver to access a database server","state":"enabled","category":"Others"},"psr":{"category":"Others","state":"disabled","description":"","name":"psr"},"date":{"description":"These functions allow you to get the date and time from the server where your PHP scripts are running. You can use these functions to format the date and time in many different ways. The date and time information is internally stored as a 64-bit number so all conceivably useful dates (including negative years) are supported. The range is from about 292 billion years in the past to the same in the future","name":"date","category":"Others","state":"build-in"},"xmlreader":{"state":"enabled","category":"Others","name":"xmlreader","description":"This is a syntactic analyzer for XML. It acts as a cursor moving along the document stream and pauses at every node on the way"},"nd_pdo_mysql":{"name":"nd_pdo_mysql","description":"","state":"disabled","category":"Others"},"igbinary":{"category":"Others","state":"disabled","description":"Igbinary is a drop in replacement for the standard php serializer. Instead of time and space consuming textual representation, igbinary stores php data structures in a compact binary form. Savings are significant when using memcached or similar memory based storages for serialized data","name":"igbinary"},"raphf":{"description":"","name":"raphf","category":"Others","state":"disabled"},"phar":{"description":"The phar extension provides a way to put entire PHP applications into a single file called a phar (PHP Archive) for easy distribution and installation. In addition to providing this service, the phar extension also provides a file-format abstraction method for creating and manipulating tar and zip files through the PharData class, much as PDO provides a unified interface for accessing different databases","name":"phar","category":"Others","state":"enabled"},"yaz":{"category":"Others","state":"disabled","description":"","name":"yaz"},"tokenizer":{"state":"build-in","category":"Others","name":"tokenizer","description":"The tokenizer functions provide an interface to the PHP tokenizer embedded in the Zend Engine. Using these functions you may write your own PHP source analyzing or modification tools without having to deal with the language specification at the lexical level"},"imagick":{"name":"imagick","description":"Imagick is a native php extension to create and modify images using the ImageMagick API","state":"disabled","category":"Others"},"tidy":{"state":"enabled","category":"Others","name":"tidy","description":"The interface for cleaning and recovering utility Tidy HTML, which apart from the cleaning and recovering allows HTML documents manipulation and document tree traverse"},"xmlrpc":{"state":"enabled","category":"Others","name":"xmlrpc","description":"These functions can be used for XML-RPC servers and clients writing"},"json":{"state":"enabled","category":"Others","name":"json","description":"Allows work with text data interchange format with parser built on JSON_checker"},"readline":{"name":"readline","description":"","state":"build-in","category":"Others"},"ctype":{"category":"Others","state":"build-in","description":"This extension functions allow to check if a symbol or a string belongs to a certain set of symbols while taking into account regional settings","name":"ctype"},"nd_mysqli":{"state":"enabled","category":"Others","name":"nd_mysqli","description":""},"zip":{"category":"Others","state":"enabled","description":"This extension lets reading compressed ZIP archives and writing into them easily","name":"zip"},"pgsql":{"state":"enabled","category":"Others","name":"pgsql","description":"Driver implementing access from PHP to PostgreSQL"},"oci8":{"category":"Others","state":"disabled","description":"","name":"oci8"},"jsmin":{"description":"","name":"jsmin","category":"Others","state":"disabled"},"intl":{"name":"intl","description":"Internationalization extension is a wrapper for ICU library, enabling PHP programmers to perform UCA-conformant collation and date, time, number, currency formatting in their scripts","state":"enabled","category":"Others"},"openssl":{"name":"openssl","description":"This module uses the functions of OpenSSL for generation and verification of signatures and for sealing (encrypting) and opening (decrypting) data","state":"build-in","category":"Others"},"gnupg":{"state":"disabled","category":"Others","name":"gnupg","description":""},"rrd":{"name":"rrd","description":"","state":"disabled","category":"Others"},"simplexml":{"name":"simplexml","description":"The SimpleXML extension provides a very simple and easily usable toolset to convert XML to an object that can be processed with normal property selectors and array iterators","state":"build-in","category":"Others"},"ftp":{"name":"ftp","description":"This module functions provide remote servers access by FTP protocol.","state":"build-in","category":"Others"},"zmq":{"name":"zmq","description":"","state":"disabled","category":"Others"},"ssh2":{"state":"disabled","category":"Others","name":"ssh2","description":""},"gd":{"state":"enabled","category":"Others","name":"gd","description":"Functions for working with images including images streaming"},"luasandbox":{"state":"disabled","category":"Others","name":"luasandbox","description":""},"zlib":{"description":"This extension enables transparent reading GZIP archives and writing into them in file system access manner","name":"zlib","category":"Others","state":"build-in"},"pcntl":{"category":"Others","state":"build-in","description":"Process Control support in PHP implements the Unix style of process creation, program execution, signal handling and process termination. Process Control should not be enabled within a web server environment because unexpected results can happen","name":"pcntl"},"hash":{"category":"Others","state":"build-in","description":"Messages hashing framework. Allows to handle arbitrary length messages by using different hashing algorithms in direct or incremental way","name":"hash"},"http":{"state":"disabled","category":"Others","name":"http","description":""},"gearman":{"name":"gearman","description":"","state":"disabled","category":"Others"},"sourceguardian":{"name":"sourceguardian","description":"SourceGuardian is commercial software which allows you to securely encode, compile and encrypt php scripts. In this way you will protect your source code from viewing and editing. You can lock your files based on the server IP where they will be opened, based on the domain name, the MAC address or a defined time period. In this way the files can not be used on a different computer, under a different domain or outside of a defined time interval","state":"disabled","category":"Others"},"filter":{"category":"Others","state":"build-in","description":"This extension filters data by either validating or sanitizing it. This is especially useful when the data source contains unknown (or foreign) data, like user supplied input. For example, this data may come from an HTML form.","name":"filter"},"brotli":{"description":"","name":"brotli","category":"Others","state":"disabled"},"swoole":{"state":"disabled","category":"Others","name":"swoole","description":""},"uuid":{"description":"A wrapper around libuuid from the ext2utils project","name":"uuid","category":"Others","state":"disabled"},"stats":{"description":"This is the statistics extension. It contains few dozens of functions useful for statistical computations","name":"stats","category":"Others","state":"disabled"},"xmlwriter":{"state":"enabled","category":"Others","name":"xmlwriter","description":"This extension is non-cached, one-direction way for generating streams of files for XML data"},"pcre":{"category":"Others","state":"build-in","description":"Perl Compatible Regular Expressions support","name":"pcre"},"pdo_oci":{"description":"","name":"pdo_oci","category":"Others","state":"disabled"},"solr":{"state":"disabled","category":"Others","name":"solr","description":""},"mailparse":{"state":"disabled","category":"Others","name":"mailparse","description":"Mailparse is an extension for parsing and working with email messages. It can deal with RFC 822 and RFC 2045 (MIME) compliant messages"},"lzf":{"category":"Others","state":"disabled","description":"This package handles LZF compression and decompression","name":"lzf"},"apcu":{"category":"Others","state":"enabled","description":"","name":"apcu"},"geos":{"description":"","name":"geos","category":"Others","state":"disabled"},"propro":{"description":"","name":"propro","category":"Others","state":"disabled"},"inotify":{"state":"disabled","category":"Others","name":"inotify","description":"The inotify extension exposes the inotify functions"},"xdebug":{"state":"disabled","category":"Others","name":"xdebug","description":"The Xdebug extension helps you debugging your script by providing a lot of valuable debug information. The debug information that Xdebug can provide includes the following: stack and function traces in error messages with full parameter display for user defined functions, function name, file name and line indications, support for member functions; memory allocation; protection for infinite recursions. Xdebug also provides: profiling information for PHP scripts; code coverage analysis; capabilities to debug your scripts interactively with a debug client"},"iconv":{"category":"Others","state":"build-in","description":"This extension provides interface to encodings conversion library iconv","name":"iconv"},"yaml":{"name":"yaml","description":"","state":"disabled","category":"Others"},"spl":{"category":"Others","state":"build-in","description":"Set of interfaces and classes for solving standard problems","name":"spl"},"session":{"description":"Session support in PHP consists of a way to preserve certain data across subsequent accesses. This enables you to build more customized applications and increase the appeal of your web site","name":"session","category":"Others","state":"build-in"},"pdo_firebird":{"category":"Others","state":"disabled","description":"","name":"pdo_firebird"},"mcrypt":{"state":"disabled","category":"Others","name":"mcrypt","description":"This is an interface to the mcrypt library, which supports a wide variety of block algorithms such as DES, TripleDES, Blowfish (default), 3-WAY, SAFER-SK64, SAFER-SK128, TWOFISH, TEA, RC2 and GOST in CBC, OFB, CFB and ECB cipher modes. Additionally, it supports RC6 and IDEA which are considered non-free. CFB and OFB are 8bit by default"},"soap":{"state":"enabled","category":"Others","name":"soap","description":"The SOAP extension can be used to write SOAP Servers and Clients. It supports subsets of SOAP 1.1, SOAP 1.2 and WSDL 1.1 specifications."},"calendar":{"state":"build-in","category":"Others","name":"calendar","description":"API for building Calendar data structures"},"reflection":{"description":"This package functionality includes full-fledged Reflection API which gives possibility for reverse-engineering of classes, interfaces, function, methods and modules","name":"reflection","category":"Others","state":"build-in"},"newrelic":{"state":"disabled","category":"Others","name":"newrelic","description":""},"mbstring":{"category":"Others","state":"enabled","description":"Provides multibyte specific string functions that help you deal with multibyte encodings in PHP. In addition to that, mbstring handles character encoding conversion between the possible encoding pairs. mbstring is designed to handle Unicode-based encodings such as UTF-8 and UCS-2 and many single-byte encodings for convenience","name":"mbstring"},"imap":{"name":"imap","description":"These functions enable you to operate with the IMAP protocol, as well as the NNTP, POP3 and local mailbox access methods","state":"enabled","category":"Others"},"pdo_odbc":{"category":"Others","state":"disabled","description":"driver that implements the PHP Data Objects (PDO) interface to enable access from PHP to databases through ODBC drivers or through the IBM DB2 Call Level Interface (DB2 CLI) library","name":"pdo_odbc"},"gmagick":{"state":"disabled","category":"Others","name":"gmagick","description":""},"dbase":{"state":"disabled","category":"Others","name":"dbase","description":"These functions allow you to access records stored in dBase-format (dbf) databases. dBase files are simple sequential files of fixed length records. Records are appended to the end of the file"},"sodium":{"state":"enabled","category":"Others","name":"sodium","description":""},"ldap":{"category":"Others","state":"disabled","description":"Functionality to work with lightweight directory access protocol servers","name":"ldap"},"sysvshm":{"state":"disabled","category":"Others","name":"sysvshm","description":"System V shared memory support"},"sysvsem":{"state":"disabled","category":"Others","name":"sysvsem","description":"System V semaphore support"},"standard":{"category":"Others","state":"build-in","description":"Standard PHP Library","name":"standard"},"core":{"state":"build-in","category":"Others","name":"core","description":"PHP interpreter body"},"uploadprogress":{"description":"It is only known to work on Apache with mod_php, other SAPI implementations unfortunately still have issues. At least PHP 5.2 is needed","name":"uploadprogress","category":"Others","state":"disabled"},"pdo_dblib":{"description":"","name":"pdo_dblib","category":"Others","state":"disabled"},"ioncube_loader":{"category":"Others","state":"disabled","description":"Introduces tools to protect software written using the PHP programming language from being viewed, changed, and run on unlicensed computers","name":"ioncube_loader"},"bcmath":{"name":"bcmath","description":"Binary Calculator for arbitrary precision mathematics which supports numbers of any size and precision, represented as strings","state":"enabled","category":"Others"},"xsl":{"name":"xsl","description":"The XSL extension implements the XSL standard, performing XSLT transformations using the libxslt library","state":"enabled","category":"Others"},"grpc":{"name":"grpc","description":"","state":"disabled","category":"Others"},"gmp":{"category":"Others","state":"build-in","description":"This module functions use GNU MP library to calculate integers of arbitrary length","name":"gmp"}}
